БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/ВедомостьОСистемеАкадемическихЗадолженностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОСистемеАкадемическихЗадолженностей</name>
  <basedOn>Document.ПриказОНазначенииКомиссииПоЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКонтроля</name>
    <type>
      <types>EnumRef.НаименованиеКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <type>
      <types>EnumRef.Оценка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусАкадемическойЗадолженности</name>
    <type>
      <types>EnumRef.НаименованиеСтатуса</types>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Enums/НаименованиеСтатуса/НаименованиеСтатуса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>НаименованиеСтатуса</name>
  <enumValues>
    <name>Активная</name>
  </enumValues>
  <enumValues>
    <name>Закрытая</name>
  </enumValues>
</mdclass:Enum>

БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностей/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьСлучайнымиДаннымиНаСервере()
    
    // Инициализируем генератор случайных чисел
    ГСЧ = Новый ГенераторСлучайныхЧисел();
    
        НаименованиеКонтроля = Объект.НаименованиеКонтроля;
        
        // Запоминаем текущую оценку для сравнения
        ТекущаяОценка = Объект.Оценка;
        НоваяОценка = Неопределено;
        
        // Устанавливаем оценку в зависимости от формы контроля
        Если НаименованиеКонтроля = Перечисления.НаименованиеКонтроля.Зачет Тогда
            // Для зачетов - только зачтено/незачтено
            Если ГСЧ.СлучайноеЧисло(1, 100) > 50 Тогда
                НоваяОценка = Перечисления.Оценка.Зачет;
            Иначе
                НоваяОценка = Перечисления.Оценка.Незачет;
            КонецЕсли;
        Иначе
            // Для других форм контроля - стандартные оценки
            СлучайнаяОценка = ГСЧ.СлучайноеЧисло(1, 4);
            Если СлучайнаяОценка = 1 Тогда
                НоваяОценка = Перечисления.Оценка.Неудовлетворительно;
            ИначеЕсли СлучайнаяОценка = 2 Тогда
                НоваяОценка = Перечисления.Оценка.Удовлетворительно;
            ИначеЕсли СлучайнаяОценка = 3 Тогда
                НоваяОценка = Перечисления.Оценка.Хорошо;
            Иначе
                НоваяОценка = Перечисления.Оценка.Отлично;
            КонецЕсли;
        КонецЕсли;
        
        // Если оценка определена, записываем новое значение
        Если НоваяОценка <> Неопределено Тогда
            // Устанавливаем новую оценку
            Объект.Оценка = НоваяОценка;
            
            // Определяем и устанавливаем статус академической задолженности
            Если НоваяОценка = Перечисления.Оценка.Незачет 
               ИЛИ НоваяОценка = Перечисления.Оценка.Неудовлетворительно Тогда
               		Объект.СтатусАкадемическойЗадолженности = 
                    Перечисления.НаименованиеСтатуса.Активная;
            Иначе
                Объект.СтатусАкадемическойЗадолженности = 
                    Перечисления.НаименованиеСтатуса.Закрытая;
            КонецЕсли;
            
            // Обновляем форму, чтобы изменения отобразились
            ЭтотОбъект.Записать();
        КонецЕсли;
        
       
КонецПроцедуры  
&НаКлиенте
Процедура ЗаполнитьСлучайнымиДанными(Команда)
    ЗаполнитьСлучайнымиДаннымиНаСервере();
КонецПроцедуры       

&НаСервере
Процедура ОценкаПриИзменении(Элемент)
    ОбновитьСтатусЗадолженности();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатусЗадолженности()
    
    ТекущаяОценка = Объект.Оценка;
    ТекущийСтатус = Объект.СтатусАкадемическойЗадолженности;
    
    // Определяем новый статус на основе оценки
    Если ТекущаяОценка = Перечисления.Оценка.Незачет 
        ИЛИ ТекущаяОценка = Перечисления.Оценка.Неудовлетворительно Тогда
        НовыйСтатус = Перечисления.СтатусыАкадемическойЗадолженности.Активная;
    ИначеЕсли ТекущаяОценка = Перечисления.Оценка.Зачет
        ИЛИ ТекущаяОценка = Перечисления.Оценка.Удовлетворительно
        ИЛИ ТекущаяОценка = Перечисления.Оценка.Хорошо
        ИЛИ ТекущаяОценка = Перечисления.Оценка.Отлично Тогда
        НовыйСтатус = Перечисления.СтатусыАкадемическойЗадолженности.Закрытая;
    Иначе
        Возврат;
    КонецЕсли;
    
    // Если статус изменился - обновляем
    Если ТекущийСтатус <> НовыйСтатус Тогда
        ЭтотОбъект.СтатусАкадемическойЗадолженности = НовыйСтатус;
    КонецЕсли;
        
КонецПроцедуры
